razzakrasmy/MouseMazeRobot/Stm32ProjectFiles/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32l4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define MCO_Pin GPIO_PIN_0
#define MCO_GPIO_Port GPIOA
#define VCP_TX_Pin GPIO_PIN_2
#define VCP_TX_GPIO_Port GPIOA
#define GPIO_FM_In_Pin GPIO_PIN_5
#define GPIO_FM_In_GPIO_Port GPIOA
#define GPIO_EXTI0_LE_Pin GPIO_PIN_0
#define GPIO_EXTI0_LE_GPIO_Port GPIOB
#define GPIO_EXTI0_LE_EXTI_IRQn EXTI0_IRQn
#define GPIO_IN_LE_Pin GPIO_PIN_8
#define GPIO_IN_LE_GPIO_Port GPIOA
#define GPIO_IN_RE_Pin GPIO_PIN_11
#define GPIO_IN_RE_GPIO_Port GPIOA
#define GPIO_FL_In_Pin GPIO_PIN_12
#define GPIO_FL_In_GPIO_Port GPIOA
#define SWDIO_Pin GPIO_PIN_13
#define SWDIO_GPIO_Port GPIOA
#define SWCLK_Pin GPIO_PIN_14
#define SWCLK_GPIO_Port GPIOA
#define VCP_RX_Pin GPIO_PIN_15
#define VCP_RX_GPIO_Port GPIOA
#define LD3_Pin GPIO_PIN_3
#define LD3_GPIO_Port GPIOB
#define GPIO_FR_In_Pin GPIO_PIN_4
#define GPIO_FR_In_GPIO_Port GPIOB
#define GPIO_FM_InB6_Pin GPIO_PIN_6
#define GPIO_FM_InB6_GPIO_Port GPIOB
#define GPIO_EXTI7_RE_Pin GPIO_PIN_7
#define GPIO_EXTI7_RE_GPIO_Port GPIOB
#define GPIO_EXTI7_RE_EXTI_IRQn EXTI9_5_IRQn

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
